# Step 1: Import the Required liabraries

In [3]:
library(dplyr)
library(ggplot2)
library(readr)
library(tidyr)

Attaching package: 'dplyr'


The following objects are masked from 'package:stats':

    filter, lag


The following objects are masked from 'package:base':

    intersect, setdiff, setequal, union

In [4]:


# Create dataset
df <- data.frame(
  Product_ID = 1:45,
  Product_Name = rep(c("Laptop", "Mobile", "Headphones", "Camera", "Tablet"), 9),
  Brand = rep(c("Dell", "Apple", "Samsung", "Sony", "HP"), 9),
  Category = rep(c("Computers", "Phones", "Accessories", "Cameras", "Tablets"), 9),
  Units_Sold = rep(c(10, 25, 40, 15, 30), 9),
  Price = rep(c(70000, 80000, 2000, 45000, 30000), 9),
  Discount = rep(c(5, 10, 15, 8, 12), 9),
  Month = rep(c("Jan", "Feb", "Mar", "Apr", "May"), 9),
  Region = rep(c("North", "South", "East", "West", "Central"), 9),
  Customer_Rating = rep(c(4.5, 4.8, 4.1, 4.3, 4.6), 9)
)

# ðŸ§¾ Step 2: Data Exploration

In [4]:
tail(df)

   Product_ID Product_Name Brand   Category    Units_Sold Price Discount Month
40 40         Tablet       HP      Tablets     30         30000 12       May
41 41         Laptop       Dell    Computers   10         70000  5       Jan
42 42         Mobile       Apple   Phones      25         80000 10       Feb
43 43         Headphones   Samsung Accessories 40          2000 15       Mar
44 44         Camera       Sony    Cameras     15         45000  8       Apr
45 45         Tablet       HP      Tablets     30         30000 12       May
   Region  Customer_Rating
40 Central 4.6
41 North   4.5
42 South   4.8
43 East    4.1
44 West    4.3
45 Central 4.6

In [5]:
head(df)

  Product_ID Product_Name Brand   Category    Units_Sold Price Discount Month
1 1          Laptop       Dell    Computers   10         70000  5       Jan
2 2          Mobile       Apple   Phones      25         80000 10       Feb
3 3          Headphones   Samsung Accessories 40          2000 15       Mar
4 4          Camera       Sony    Cameras     15         45000  8       Apr
5 5          Tablet       HP      Tablets     30         30000 12       May
6 6          Laptop       Dell    Computers   10         70000  5       Jan
  Region  Customer_Rating
1 North   4.5
2 South   4.8
3 East    4.1
4 West    4.3
5 Central 4.6
6 North   4.5

In [7]:
sample_n(df, 5)

  Product_ID Product_Name Brand   Category    Units_Sold Price Discount Month
1 21         Laptop       Dell    Computers   10         70000  5       Jan
2 17         Mobile       Apple   Phones      25         80000 10       Feb
3 31         Laptop       Dell    Computers   10         70000  5       Jan
4  1         Laptop       Dell    Computers   10         70000  5       Jan
5 28         Headphones   Samsung Accessories 40          2000 15       Mar
  Region Customer_Rating
1 North  4.5
2 South  4.8
3 North  4.5
4 North  4.5
5 East   4.1

In [9]:
summary(df)

   Product_ID Product_Name          Brand             Category
 Min.   : 1   Length:45          Length:45          Length:45
 1st Qu.:12   Class :character   Class :character   Class :character
 Median :23   Mode  :character   Mode  :character   Mode  :character
 Mean   :23
 3rd Qu.:34
 Max.   :45
   Units_Sold     Price          Discount     Month
 Min.   :10   Min.   : 2000   Min.   : 5   Length:45
 1st Qu.:15   1st Qu.:30000   1st Qu.: 8   Class :character
 Median :25   Median :45000   Median :10   Mode  :character
 Mean   :24   Mean   :45400   Mean   :10
 3rd Qu.:30   3rd Qu.:70000   3rd Qu.:12
 Max.   :40   Max.   :80000   Max.   :15
    Region          Customer_Rating
 Length:45          Min.   :4.10
 Class :character   1st Qu.:4.30
 Mode  :character   Median :4.50
                    Mean   :4.46
                    3rd Qu.:4.60
                    Max.   :4.80

In [10]:
str(df)

'data.frame':	45 obs. of  10 variables:
 $ Product_ID     : int  1 2 3 4 5 6 7 8 9 10 ...
 $ Product_Name   : chr  "Laptop" "Mobile" "Headphones" "Camera" ...
 $ Brand          : chr  "Dell" "Apple" "Samsung" "Sony" ...
 $ Category       : chr  "Computers" "Phones" "Accessories" "Cameras" ...
 $ Units_Sold     : num  10 25 40 15 30 10 25 40 15 30 ...
 $ Price          : num  70000 80000 2000 45000 30000 70000 80000 2000 45000 30000 ...
 $ Discount       : num  5 10 15 8 12 5 10 15 8 12 ...
 $ Month          : chr  "Jan" "Feb" "Mar" "Apr" ...
 $ Region         : chr  "North" "South" "East" "West" ...
 $ Customer_Rating: num  4.5 4.8 4.1 4.3 4.6 4.5 4.8 4.1 4.3 4.6 ...

In [11]:
dim(df)

[1] 45 10

In [12]:
colnames(df)

 [1] "Product_ID"      "Product_Name"    "Brand"           "Category"
 [5] "Units_Sold"      "Price"           "Discount"        "Month"
 [9] "Region"          "Customer_Rating"

In [13]:
head(df)

  Product_ID Product_Name Brand   Category    Units_Sold Price Discount Month
1 1          Laptop       Dell    Computers   10         70000  5       Jan
2 2          Mobile       Apple   Phones      25         80000 10       Feb
3 3          Headphones   Samsung Accessories 40          2000 15       Mar
4 4          Camera       Sony    Cameras     15         45000  8       Apr
5 5          Tablet       HP      Tablets     30         30000 12       May
6 6          Laptop       Dell    Computers   10         70000  5       Jan
  Region  Customer_Rating
1 North   4.5
2 South   4.8
3 East    4.1
4 West    4.3
5 Central 4.6
6 North   4.5

# ðŸ§¹ Step 3: Data Cleaning

### Drop a column

In [14]:
df<-select(df,-Discount)

In [23]:
head(df)

  Product_ID Product_Name Brand   Category    Units_Sold Unit_price Discount
1 1          Laptop       Dell    Computers   10         70000       5
2 2          Mobile       Apple   Phones      25         80000      10
3 3          Headphones   Samsung Accessories 40          2000      15
4 4          Camera       Sony    Cameras     15         45000       8
5 5          Tablet       HP      Tablets     30         30000      12
6 6          Laptop       Dell    Computers   10         70000       5
  Month Region  Customer_Rating Revenue r1        r2      Quantity
1 Jan   North   4.5              665000  69965000  665000 1
2 Feb   South   4.8             1800000 199800000 1800000 1
3 Mar   East    4.1               68000   7988000   68000 1
4 Apr   West    4.3              621000  67446000  621000 1
5 May   Central 4.6              792000  89892000  792000 1
6 Jan   North   4.5              665000  69965000  665000 1

In [22]:
df$Quantity<-1

### Rename a column

In [12]:
df<-rename(df,Unit_price=Price)

In [17]:
head(df)

  Product_ID Product_Name Brand   Category    Units_Sold Unit_price Month
1 1          Laptop       Dell    Computers   10         70000      Jan
2 2          Mobile       Apple   Phones      25         80000      Feb
3 3          Headphones   Samsung Accessories 40          2000      Mar
4 4          Camera       Sony    Cameras     15         45000      Apr
5 5          Tablet       HP      Tablets     30         30000      May
6 6          Laptop       Dell    Computers   10         70000      Jan
  Region  Customer_Rating
1 North   4.5
2 South   4.8
3 East    4.1
4 West    4.3
5 Central 4.6
6 North   4.5

### Remove duplicates

In [18]:
df<-distinct(df)

### Filter data

In [21]:
filter(df,Brand=='HP')

  Product_ID Product_Name Brand Category Units_Sold Unit_price Discount Month
1  5         Tablet       HP    Tablets  30         30000      12       May
2 10         Tablet       HP    Tablets  30         30000      12       May
3 15         Tablet       HP    Tablets  30         30000      12       May
4 20         Tablet       HP    Tablets  30         30000      12       May
5 25         Tablet       HP    Tablets  30         30000      12       May
6 30         Tablet       HP    Tablets  30         30000      12       May
7 35         Tablet       HP    Tablets  30         30000      12       May
8 40         Tablet       HP    Tablets  30         30000      12       May
9 45         Tablet       HP    Tablets  30         30000      12       May
  Region  Customer_Rating Revenue r1       r2
1 Central 4.6             792000  89892000 792000
2 Central 4.6             792000  89892000 792000
3 Central 4.6             792000  89892000 792000
4 Central 4.6             792000  89892000 792000
5 Central 4.6             792000  89892000 792000
6 Central 4.6             792000  89892000 792000
7 Central 4.6             792000  89892000 792000
8 Central 4.6             792000  89892000 792000
9 Central 4.6             792000  89892000 792000

### ðŸ§  Step 4: Feature Engineering

In [13]:
df<-mutate(df,Revenue=Units_Sold * Unit_price*(1-Discount/100))

In [20]:
df<-mutate(df,Custom Revenue=Units_Sold*Unit_price*((100-Discount)/100))